Repository: rsashka/newlang
Catalog: docs/ru_en/omegat/project_save.tmx
Source language: ru_ru
Languages: en_us

source: --- title: NewLang --- {{< blocks/cover title="Добро пожаловать на сайт проекта NewLang!" image_anchor="top" height="auto" >}} Документация Статьи GitHub {{< blocks/link-down color="info" >}} {{< /blocks/cover >}} {{% blocks/lead %}}
en_us: --- title: NewLang --- {{< blocks/cover title="Welcome NewLang!" image_anchor="top" height="auto" >}} Documents Articles GitHub {{< blocks/link-down color="info" >}} {{< /blocks/cover >}} {{% blocks/lead %}}

source: /ru/blog/
en_us: /blog/

source: /ru/docs/
en_us: /docs/

source: DSL (Предметно-ориентированный язык) - язык программирования, специализированный для конкретной области применения.
en_us: [DSL](https://en.wikipedia.org/wiki/Domain-specific_language) (Subject Oriented Language) is a programming language specialized for a specific application area.

source: В этом случае под термином "DSL" будет скрываться просто набор специфических терминов предметной области, переопределенных макросов и/или операторов, но использование которых будет ограничено грамматикой языка реализации.
en_us: In this case, the term "DSL" will simply be a set of domain-specific terms, overridden macros and/or operators, but the use of which will be restricted by the implementation language grammar.

source: Но помощью макросов препроцесора, синтаксис превращается в DSL на основе ключевых слов.
en_us: But with the help of preprocessor macros, the syntax turns into DSL based on keywords.

source: NewLang - язык программирования высокого уровня общего назначения с синтаксисом на строгой системе грамматических правил.
en_us: NewLang - is a general-purpose high-level programming language with a syntax based on a strict system of grammatical rules.

source: {{< blocks/cover title="Добро пожаловать на сайт проекта NewLang!" image_anchor="top" height="auto" >}}
en_us: {{< blocks/cover title="Welcome NewLang!" image_anchor="top" height="auto" >}}

source: «Нет в мире совершенства», и после выпуска релиза NewLang 0.2 я получил много отзывов (по большей части негативных), по поводу первого варианта реализации макросов и DSL на их основе.
en_us: "There is no perfection in the world", and after the release of **NewLang 0.2**, I received a lot of feedback (mostly negative), about the first version of [macro implementation](https://github.com/rsashka/newlang/blob/v0.3.0/docs/syntax.md#макросы) and [DSL based on it](https://github.com/rsashka/newlang/blob/v0.3.0/docs/syntax_dsl.md).

source: Вплоть до того, что «для каждого нового проекта придется изучать новый язык… ».
en_us: Up to the point that "for every new project you will have to learn a new language...".

source: Главная особенность макросов в том, что они позволяют изменять выражения еще до их вычисления во время выполнения.
en_us: That's why if you don't specify a modifier before the **NewLang** object name (**\**macros, **$**local_variable or **@**module), the program will first search among macros, then among local variables and finally among modules (object from module).

source: Далее речь пойдет о втором варианте, а именно, о реализации DSL на базе языков (метаязыков) общего назначения и новом варианте реализации макросов в NewLang как основы для разработки DSL.
en_us: We will talk about the second option, namely the implementation of DSL on the basis of general-purpose languages (metalanguages) and the new implementation of macros in NewLang as the basis for DSL development.

source: Две крайности
en_us: Two extremes

source: Для обсуждения предлагается следующая реализация макросов
en_us: The following implementation of macros is offered for discussion

source: Документация
en_us: Docs

source: Если же язык (метаязык) позволяет модифицировать собственную грамматику (например на уровне AST), то DSL уже не будет жестко огранен синтаксисом базового языка программирования, и в результате его грамматика может быть какой угодно.
en_us: If a language (metalanguage) allows you to modify its own grammar (for example at the level of [AST](https://en.wikipedia.org/wiki/Abstract_syntax_tree)), then DSL will no longer be strictly bounded by the syntax of the underlying programming language, and as a result its grammar can be whatever you want.

source: Если язык программирования ограничен собственной фиксированной грамматикой и не допускает её расширения, то при реализации DSL разработчик будет вынужден использовать уже существующую грамматику, правила записи операций и вообще весь синтаксис будет оставаться такими же, как в языке реализации.
en_us: If a programming language is limited to its own fixed grammar and does not allow for its expansion, when implementing DSL the developer will be forced to use the existing grammar, the rules for recording operations and generally all syntax will remain the same as in the implementation language.

source: И если положить руку на сердце, эта критика часто была обоснованной.
en_us: And those criticisms were often valid.

source: Используемая терминология
en_us: Terminology Used

source: Макросы в NewLang, это один или несколько терминов, которые заменяются на другой термин или на целую синтаксическую конструкцию (последовательность лексем).
en_us: Macros in *NewLang*, are one or more terms that are replaced by another term or by an entire lexical construct (a sequence of tokens). Macros are both an extension of basic language syntax, when implementing DSL's own dialects, and a syntax sugar.

source: Макросы являются одновременно и расширением базового синтаксиса языка, при реализации собственных диалектов DSL, и синтаксическим сахаром.
en_us: The main feature of macros is that they allow expressions to be changed before they are evaluated at runtime. Macros are expanded at runtime **lexer**, which allows you to substitute any other terms with them and even modify the language syntax itself.

source: Наверно имеет смысл начать с описания о двух крайностях при реализации DSL на базе языка (метаязыка) общего назначения:
en_us: It probably makes sense to start by describing two extremes in the implementation of a DSL based on a general-purpose language (metalanguage):

source: Например, при использовании в качестве базового языка С/С++ или применении различных библиотек и фреймворков в других языках программирования общего назначения.
en_us: For example, when using C/C++ as a base language, or using various libraries and frameworks in other general-purpose programming languages.

source: Неограниченная грамматика
en_us: Unrestricted grammar

source: О чем идет речь?
en_us: What is it about?

source: Ограниченная грамматика
en_us: Limited grammar

source: Описание акутально для текущей версии 4.0
en_us: The description is relevant for the current version 4.0

source: Основные материалы по языку программирования NewLang.
en_us: Basic materials on the NewLang programming language.

source: Основные свойства и особенности языка:
en_us: The main properties and features of the language:

source: Очень рекомендую прочитать о метапрограммровании великолепную статью @NeoCode Метапрограммирование: какое оно есть и каким должно быть.
en_us: I strongly recommend you to read an excellent article on metaprogramming by @NeoCode [Metaprogramming: what it is and what it should be (written in Russian)] (https://habr.com/post/258667/).

source: Поэтому я решил попробовать немного переделать макросы, в надежде получить «золотую середину» между двумя описанными выше крайностями при описании DSL.
en_us: So I decided to try to redesign the macros a bit, in hopes of getting a "middle ground" between the two extremes described above when describing the DSL.

source: Разработка или встраивание диалекта DSL на языке (метаязыке) общего назначения, в том числе за счет применения различных библиотек или специальных парсеров / препроцессоров.
en_us: Development or integration of the DSL dialect into a general-purpose language (metalanguage), including the use of various libraries or special parsers / preprocessors.

source: Разработка независимых трансляторов синтаксиса с помощью генераторов лексеров и парсеров для определения грамматики целевого языка посредством БНФ и регулярных выражений (Lex, Yacc, ANTLR и т. д.) и последующей компиляцией полученной грамматики в машинный код.
en_us: Development of independent syntax translators using lexer and parser generators to define the grammar of the target language through BNF (Backus–Naur form) and regular expressions (Lex, Yacc, ANTLR, etc.) and then compiling the resulting grammar into machine code.

source: Статьи
en_us: Articles

source: Считается, что использование DSL существенно повышает уровень абстрактности кода, а это позволяет вести разработку более быстро и эффективно и существенно упрощает решение многих задач.
en_us: It is believed that the use of DSL significantly increases the level of abstractness of the code, and this allows to develop more quickly and efficiently and greatly simplifies the solution of many problems.

source: Тензорные вычисления и рациональные числа не ограниченной точности поддерживаются на уровне синтаксиса языка и базовых типов данных без использования дополнительных библиотек.
en_us: Tensor calculations and rationals of unlimited precision are supported at the level of language syntax and basic data types without the use of additional libraries.

source: Условно, можно выделить два подхода к реализации DSL:
en_us: Conditionally, we can distinguish two approaches to DSL implementation:

source: Это можно сделать с помощью использования специализированных метаязыков (Lisp, ML, Haskell, Nemerle, Forth, Tcl, Rebol и пр.)
en_us: This can be done by using specialized metalanguages (Lisp, ML, Haskell, Nemerle, Forth, Tcl, Rebol, etc.)
